app/controllers/users_controller.rb

INSERT INTO `users` (`updated_at`, `title`, `price`, `description`, `created_at`) VALUES('2010-07-15 04:39:36', 'java', 120, 'book', '2010-07-15 04:39:36')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save